"ConfirmSaveTitle" 			= "Vahvista Tallennus";
"ConfirmSaveMsg"			= "Haluatko tallentaa liikkuvuusasetuksiin tehdyt muutokset?";
"ConfirmSaveSave"			= "Tallenna";
"ConfirmSaveCancel"			= "Kumoa";
"ConfirmSaveDontSave"		= "Älä tallenna";

// Text of "OK" button in configuration sheet (depending on whether we are in 'create' or 'config settings' mode)
"str_OK_Create" = "Luo";
"str_OK_Config" = "OK";

// Text that goes under the "Use FileSync" checkbox depending on whether computer has master password or not
"str_HaveMasterPassword" 	= "Tietokoneelle on asetettu FileVault-pääsalasana.";
"str_NoMasterPassword" 		= "FileVault edellyttää pääsalasanaa tälle tietokoneelle.";

// Template for displaying the startup volume name
"str_BootVolumeNameTemplate" = "%@ (Käynnistyslevy)";

// For pre-flighting available space (4875784)
"str_PHD_CalcAvailSpace" = "Lasketaan vapaata tilaa...";
"str_PHD_InsufficientSpace" = "Kohteessa ”%@” ei ole riittävästi vapaata tilaa kotikansion luomiseen.";


// Sync interval popup values (4978958)
"str_SyncInterval_Automatic" 	= "Automaattisesti";
"str_SyncInterval_Manual"  		= "Käsin";

"str_SyncInterval_OneMinute" 					= "Minuutin välein";
"str_SyncInterval_LessThanOneHour"  			= "%d minuutin välein";
"str_SyncInterval_OneHour"						= "Tunnin välein";
"str_SyncInterval_OneHourOneMinute"				= "1 tunnin ja 1 minuutin välein";
"str_SyncInterval_LessThanTwoHours"				= "1 tunnin ja %d minuutin välein";
"str_SyncInterval_MoreThanOneHourNoMinutes"		= "%d tunnin välein";
"str_SyncInterval_MoreThanOneHourOneMinute"		= "%d tunnin ja 1 minuutin välein";
"str_SyncInterval_MoreThanOneHourManyMinutes"	= "%d tunnin ja %d minuutin välein";


// No suitable volumes for home volume (5182972) - displayed in popup menu
"str_UserPicks_NoExternalVolume" 		= "Ulkoisia taltioita ei ole liitetty.";
"str_UserPicks_NoSuitableVolume" 		= "Sopivia taltioita ei löytynyt.";
